[
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "reliability",
                        "operationalexcellence",
                        "performanceefficiency",
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Azure Kubernetes Service (AKS)",
        "title":  "Scalability",
        "children":  [
                         {
                             "title":  "Enable [cluster autoscaler](https://docs.microsoft.com/azure/aks/cluster-autoscaler) to automatically adjust the number of agent nodes in response to resource constraints.",
                             "context":  "This ability to automatically scale up or down the number of nodes in your AKS cluster lets you run an efficient, cost-effective cluster.",
                             "id":  "36a02822-19a3-4f9e-9895-3f3b1891ae23"
                         },
                         {
                             "title":  "Consider using [Azure Spot VMs](https://docs.microsoft.com/azure/aks/spot-node-pool) for workloads that can handle interruptions, early terminations, or evictions. For example, workloads such as batch processing jobs, development and testing environments, and large compute workloads may be good candidates to be scheduled on a spot node pool.",
                             "context":  "Using spot VMs for nodes with your AKS cluster allows you to take advantage of unutilized capacity in Azure at a significant cost savings.",
                             "id":  "45029e3d-02e9-4bbb-88c7-42a965b8725e"
                         },
                         {
                             "title":  "Utilize the [Horizontal pod autoscaler](https://docs.microsoft.com/azure/aks/concepts-scale#horizontal-pod-autoscaler) to adjust the number of pods in a deployment depending on CPU utilization or other select metrics.",
                             "id":  "efa32f49-cc48-4cf1-b725-5a8faa72f227"
                         },
                         {
                             "title":  "Separate workloads into different node pools and consider scaling user node pools to zero.",
                             "context":  "Unlike System node pools that always require running nodes, User node pools allow you to scale to 0.",
                             "id":  "6a985f79-6f75-4a60-a0ab-9dd80a5f11a3"
                         }
                     ],
        "id":  "fd3a7975-91c0-4520-94db-639db35469f0",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    },
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Azure App Service",
        "title":  "Consider the cost savings of using App Service Premium v3 plan over the Premium v2 plan.",
        "context":  "The App Service Premium (v3) Plan has a 20% discount versus comparable Pv2 configurations. Reserved Instance commitment (1Y, 3Y, Dev/Test) discounts are available for App Services running in the Premium v3 plan.",
        "id":  "da1d85e3-0548-4df8-8fb0-1095dd1c9f5e",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    },
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Virtual Machines",
        "title":  "Perform a review of SKUs that could benefit from Reserved Instances for 1 or 3 years or more.",
        "context":  "Purchasing reserved instances is a way to reduce Azure costs for workloads with stable usage. You have to manage utilization: if it’s too low then you are paying for resources that are not being used. One advice is to keep RI instances simple and not trying to have too much management overhead that has to be factored in as well as part of the cost.",
        "id":  "6c63c516-41be-48fa-a880-3f2ee48edb82",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    },
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Virtual Machines",
        "title":  "Consider using Burstable (B) series VM sizes for VMs that are idle most of the time and have high usage for a certain period of time.",
        "context":  "The B-series VMs are ideal for workloads that do not need the full performance of the CPU continuously (like web servers, proof of concepts, small databases and development build environments).",
        "id":  "414a95d2-c631-408c-a88d-15ab728f9640",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    },
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Virtual Machines",
        "title":  "Shut down VM instances which are not in use.",
        "context":  "Use the Start/Stop VMs during off-hours feature of virtual machines to minimize waste. There are many configuration options to schedule start the stop times. The feature is suitable as a low-cost automation option. Azure Advisor evaluates virtual machines based on CPU and network utilization over a time period and recommends actions like shut down or resize instances.",
        "id":  "bfbea384-42b4-4edf-8baa-4f806c00b85b",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    },
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Virtual Machines",
        "title":  "Use Spot VMs when appropriate.",
        "context":  "Spot VMs are ideal for workloads that can be interrupted, such as highly parallel batch processing jobs. These VMs take advantage of the surplus capacity in Azure at a lower cost. They\u0027re also well suited for experimenting, development and testing of large-scale solutions.",
        "id":  "117961fd-2a98-472c-a4f5-69967447e440",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    },
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Virtual Machines",
        "title":  "Consider PaaS as an alternative to virtual machines.",
        "context":  "When you use the PaaS model, operational and maintenance costs are included in the pricing and in some cases can be cheaper than managing VMs on your own.",
        "id":  "02e60cdc-dd3d-4c96-997d-ff14dda201e1",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    },
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Virtual Machines",
        "title":  "Use Zone to Zone disaster recovery for virtual machines.",
        "context":  "(in preview as of 11/2020) Replicate, failover and failback your business-critical virtual machines within the same region with zones. Ideal for those that have complicated networking infrastructure and want to avoid the cost and complexity of recreating it in a secondary region.",
        "id":  "78e97b23-894b-4b55-a21e-7154976923a1",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    },
    {
        "type":  "Configuration Recommendations",
        "pillars":  [
                        "costoptimization"
                    ],
        "lens":  "service",
        "category":  "Compute",
        "subCategory":  "Azure Kubernetes Service (AKS)",
        "title":  "Use the Start/Stop feature in Azure Kubernetes Services (AKS).",
        "context":  "(in preview as of 11/2020) The AKS Stop/Start cluster feature now in public preview allows AKS customers to completely pause an AKS cluster, saving time and cost. The stop/start feature keeps cluster configurations in place and customers can pick up where they left off without reconfiguring the clusters.",
        "id":  "814f9737-b177-46cc-966e-77674d2033e0",
        "tags":  [
                     "all",
                     "Compute"
                 ],
        "priority":  "medium"
    }
]
